{"0": {"current_obs": "While visiting the ward of a patient who had passed away, you unexpectedly found a dream stone glowing with a faint blue light. The moment you touched it, the reality around you began to distort; the walls of the ward rippled like water waves, and you saw the nightmare the patient was experiencing—a dark world filled with twisted buildings and strange creatures. Through the dream stone, it seemed you could see a crack leading to the nightmare dimension slowly forming in the ward. The patient's vital signs started to fluctuate drastically, and from the crack, a tentacle made of shadows slowly emerged, seemingly trying to drag the patient into an eternal nightmare.", "action": "Explore", "valid_action": ["Explore", "Fight"]}, "1": {"current_obs": "Continue your investigation. You follow the instructions of the crack radar through the ruins of the city until you reach an abandoned library. The library is scattered with nightmare records and research reports from around the world, looking as if some scholar had tried to unravel the secrets of the nightmare phenomenon. Inside a secret room of the library, you find an ancient, dusty book titled \"The Gates Between Dreams and Reality.\" This book details how to use the Stone of Dreams to open and stabilize the passage between nightmares and reality, but it also warns of its potential dangers. As you carefully study it, you feel a cold draft from behind. Turning around, a shadowy creature is standing quietly at the door, its gaze piercing towards you like a cold knife, seemingly waiting for your reaction.", "action": "Escape", "valid_action": ["Fight", "Escape"]}, "2": {"current_obs": "After escaping from the library, you struggle forward in the menacing darkness, filled with fear and unease. Your stomach churns with nerves, as the breathing sounds of an ominous creature echo in your ears. Wandering aimlessly for a while, you finally arrive in front of a rundown small church. Here, an apparently friendly old priest is walking out of the church. Seeing your exhausted and panicked appearance, he says to you, “Child, it looks like you need help. But remember, redemption sometimes comes at a price.” He invites you into the church to seek refuge, but you feel a certain oppressive aura about him, as if he’s hiding a secret unknown to others.", "action": "Help", "valid_action": ["Help", "Betray"]}, "3": {"current_obs": "After entering the old, small chapel, the old priest leads you down a long corridor to the back of the church. There is an altar here, with some ancient relics and a thick Bible on it. The priest picks up one of the relics—a seemingly ordinary cross—and begins to pray quietly. During the prayer, you notice that the cross starts to emit a faint golden glow. After he finishes praying, he turns to face you, his eyes suddenly sharp. \"This is the power bestowed upon us by God, it can help us cleanse the pollution of nightmares. But using it requires a great sacrifice.\" His words make you feel uneasy, and you begin to question his real intentions. Sensing your hesitation, the priest smiles and adds, \"Are you ready to receive this power and make sacrifices for our goal? Your decision will affect the fate of everyone here.\"\n", "action": "Escape", "valid_action": ["Fight", "Escape"]}, "4": {"current_obs": "You escape from the big door of the small chapel, and the night wind hits your face, bringing a piercing chill. However, the doubts and fears in your heart still bother you. You hesitate in the dark night for a moment and decide to continue along the winding alley, searching for new clues or a shelter. Wandering aimlessly through the gloomy streets, you find an old warehouse covered in soot and dust. A thin figure stands at the entrance of the warehouse. He looks like a wanderer, his eyes tired but sharp. He seems to notice your hesitation and says softly, \"Pursuing the truth always comes with risks, but running away is not a solution. I know some secrets about the eternal plague, which might help you.\" There seems to be an unknown danger lurking in the shadows behind him, but the information he offers might be the only clue you can find to get answers.", "action": "Help", "valid_action": ["Help", "Refuse"]}, "5": {"current_obs": "Following a mysterious wanderer into an old warehouse, under the dim lighting, the inside of the warehouse was filled with strange items and faded maps. The wanderer pulled out some dusty papers from a pile of messy documents, which contained case analyses of eternal nightmares. Pointing at a map marked with several crack locations, he said, \"These cracks are not just appearing randomly; they are intentionally created by some unknown force. We need to explore a specific crack, which might hide the real power behind the everlasting plague.\" There was a hint of urgency and caution in his eyes; it was a dangerous path, but also the hope for saving the world. As his words ended, suddenly there were rapid footsteps outside the warehouse, as if someone or something was approaching.", "action": "Fight", "valid_action": ["Explore", "Fight"]}}