{"0": {"current_obs": "In your daily work as an assistant at the Prophecy Library, you accidentally find an unusual book of destiny. When you open it, the words on the pages begin to glow, revealing a prophecy about yourself: \"The changer of fate will make a decision at the darkest moment, the end and rebirth of the world depend on this person.\" Just then, you hear footsteps coming from two directions: one is the library's head prophet, who has always advocated strictly following the guidance of prophecies; the other is a mysterious masked person, said to be an important figure representing the faction that resists fate. It seems both have sensed the appearance of this special book of destiny.", "action": "Explore", "valid_action": ["Explore", "Escape"]}, "1": {"current_obs": "After choosing to delve further into the investigation, you carefully placed the special book of destiny into your backpack and continued your research in a secluded corner of the library. In the evening, as the library lights dimmed, you secretly searched for other materials that might be related to this book. On a dusty shelf, you found another ancient document titled \"Interpretation of Prophecy,\" which seemed to contain methods that could help you understand the book of destiny you held.\n\nWhile you were engrossed in reading, suddenly you felt a cold breeze. A mysterious masked person quietly stood behind you and calmly said, \"You have touched the edge of destiny, be careful with your choices, they will lead you to light or darkness.\" The masked person seemed very interested in your discovery and wanted to jointly explore deeper secrets. However, his proposal was full of unknowns and dangers, especially in the vortex of fate.", "action": "Help", "valid_action": ["Help", "Refuse"]}, "2": {"current_obs": "After choosing to help the masked person, the two of you secretly plot in the library late at night on how to uncover more secrets from the Book of Destiny. The masked person takes you to a hidden basement, where documents overlooked or banned by the prophets are kept. Among these documents, you find a crucial prophecy suggesting that the outcome can be changed through a certain ritual. The masked person suggests performing this dangerous ritual immediately, attempting to alter fate before the disaster strikes. At the same time, he reveals that he is a high-ranking member of the anti-destiny faction, and this action might provoke a strong backlash from the prophets.\n\nYou realize that carrying out the ritual could pose great risks, including angering the powerful prophets and potential unknown consequences. At this point, you start to hesitate, wondering whether to continue following the masked person to fight against the set destiny, or to be more cautious, further explore and understand all the consequences before making a decision.", "action": "Explore", "valid_action": ["Explore", "Fight"]}, "3": {"current_obs": "Before deciding to further investigate the possible consequences of the ritual, you and the masked person went deep into the library's secret archive room, a dark and forgotten room filled with countless banned or ignored prophecies. On the dusty bookshelf, you found an ancient book titled \"The Cost of Prophecy,\" which described the disasters and failures faced by those who had tried to change their fate in the past. The stories were cautionary but also hinted that some prophecies might indeed be changeable if the right methods are found.\n\nMeanwhile, you noticed a document listing all known rituals and their effects, which might be key to understanding and predicting the consequences of the ritual. However, just then, a rush of hurried footsteps broke the silence as the chief seer, leading a group of guards, burst in. Their expressions were stern, obviously there to stop you. The chief seer glared and sternly warned, \"You are challenging the boundaries of fate. If you do not stop immediately, you will face serious consequences.\"", "action": "Help", "valid_action": ["Help", "Betray", "Fight"]}, "4": {"current_obs": "In the chief seer’s warning voice, the air almost solidified. The masked person gripped your shoulder and whispered, “This is our only chance, only we can rewrite this doom.” He pulled you to escape deeper into the basement, with the chief seer and her guards closely following. You passed through a series of twisting secret passages and finally arrived at an altar covered with forbidden magical symbols. The masked person quickly began preparing the ritual, while you stood by, filled with conflict. On one hand, you longed to know the true meaning of changing fate; on the other hand, you were worried that doing so might trigger unforeseen disasters. Just as the ritual was halfway through, the chief seer and her guards broke through the last line of defense and appeared before you, raging.", "action": "Refuse", "valid_action": ["Refuse", "Fight"]}, "5": {"current_obs": "In a tense atmosphere, you suddenly stood up and said firmly to the masked man and the chief soothsayer, \"I cannot let this ceremony continue. We do not fully understand its consequences, and it would be irresponsible to do so.\" A flash of disappointment and anger crossed the masked man's eyes. He tried to persuade you one last time, but you had already made up your mind. Seeing your determination, the chief soothsayer showed a complex expression and ordered the guards to withdraw, proposing a one-on-one discussion with you. Knowing the situation was against him, the masked man gave you a deep look before disappearing into the dark corridor, leaving a warning: \"The game of fate is far from over.\" The chief soothsayer took you into a secret room in the library, where she started to explain the importance of the book of fate and the catastrophic consequences of challenging fate.", "action": "Explore", "valid_action": ["Explore", "Betray"]}}