{"0": {"current_obs": "On the night of the king's funeral, while you were organizing the late king's relics in the royal library, you accidentally discovered a letter sealed with wax, hidden in an ancient book. The envelope bore the royal crest, but the wax seal was the personal mark of the eldest prince. Through the candlelight, you could barely make out words like \"poison\" and \"assassination\" in the letter. Just then, the library door was pushed open, and the trusted advisor of the second prince and the civilian guard of the third prince approached from different directions, obviously also searching for something. Moonlight streamed through the stained-glass windows, casting eerie shadows on the floor.", "action": "Explore", "valid_action": ["Explore", "Escape"]}, "1": {"current_obs": "You decide to continue exploring and look closely at the details of the secret letter. The handwriting in the letter is messy, seemingly written in haste and nervousness. You extract a vague location from the letter - \"the old house in the dense forest\", which is clearly an important clue. You prepare to secretly visit this place to investigate, but before you leave, the second prince's close advisor discovers your presence and approaches you to suggest a collaboration to find proof to strengthen the second prince's claim to the throne. At this moment, the commander of the third prince's civilian guard also notices the secret letter in your hand, a cunning look flashing in his eyes, and he proposes to help you investigate the truth to uncover any potential conspiracy.", "action": "Refuse", "valid_action": ["Help", "Refuse"]}, "2": {"current_obs": "After rejecting the help of the second prince's advisor and the third prince's commoner guard commander, you went alone to the \"Old Forest House.\" As you walked deeper into the forest, you seemed to see figures flickering among the shadows, making the environment eerily unsettling. You carefully pushed open the big door of the old house and found it filled with dust and some strange symbols, clearly indicating that it had been used for some secret activities. In the cellar, you unexpectedly found a batch of carefully hidden supplies, including a detailed plan \"against the third prince\" and an unopened bottle of poison. Just then, footsteps came from outside the door, and you realized someone had followed you here.", "action": "Help", "valid_action": ["Help", "Fight"]}, "3": {"current_obs": "The footsteps behind you are getting closer, so you quickly hide in the shadows and hold your breath. Suddenly, a familiar face appears at the door—it's the Second Prince's trusted adviser. He doesn't seem to notice you, and looks around vigilantly. Faced with this sudden situation, you quickly think of a plan. Just as you're about to sneak away, the Third Prince's civilian guard commander bursts in and sees both you and the adviser. To break the deadlock and use the information you have, the commander suggests teaming up with you to temporarily confront the adviser and protect the important evidence together.", "action": "Escape", "valid_action": ["Fight", "Escape"]}, "4": {"current_obs": "You hurriedly walk through the woods, hearing the voices of the strategists and commanders gradually fading behind you. The last rays of the sunset filter through the dense forest, casting a mysterious hue on your path of escape. Soon, you arrive at a clear fork in the road. The path on the left seems to lead to a village, while the path on the right leads to a wide open area with an abandoned tower. Your intuition tells you that this tower might be related to the plan found in the old house. Suddenly, you notice that your ghostly pursuer has not completely given up, as you hear intermittent footsteps in the distance. At this moment, a critical decision lies before you.", "action": "Explore", "valid_action": ["Explore", "Escape"]}, "5": {"current_obs": "As you carefully approach the abandoned tower, the last ray of the sunset shines on the crumbling stone walls, making them look especially desolate. The tower seems to have been eroded by many years of wind and rain, but its ground floor doors are still tightly shut, with fallen pebbles and weeds scattered around. You walk to the back of the tower and find a partially collapsed window that serves as a possible entry path. Just as you try to get closer to the window, a cold voice speaks up behind you: \"Friend, it seems you and I have a similar purpose.\" Turning around, it is the strategist you had earlier escaped from, his expression showing no hostility, seemingly seeking cooperation. He explains that he too is curious about the secrets of the tower and suggests exploring the inside of the tower together to find useful clues.", "action": "Fight", "valid_action": ["Help", "Fight"]}}