{"0": {"current_obs": "During a routine sanity check, you discovered a strange crystal pendant. When you touched it, the thought waves of the people around you suddenly became clearly visible—some were like calm lakes, while others were like boiling magma. What was even more shocking was that you saw a strange black mist swirling around the head of a staff member at the testing center. His thoughts were starting to fragment, but he was still conducting the tests. This person was recording and marking \"normal\" and \"infected,\" and his distorted judgment might lead to innocent people being isolated, or real infected individuals blending into society. His list already had the names of more than a dozen people.", "action": "Explore", "valid_action": ["Explore", "Fight"]}, "1": {"current_obs": "You decided to investigate a staff member’s actions secretly to prevent the wrong quarantine orders from being executed. At night, you quietly entered the archive room of the testing center and found his personal records and the names that had been marked. The documents showed he had been working in this position for many years and had always performed well, but the records of his behavior in the recent weeks showed obvious anomalies—his judgments were becoming hasty and arbitrary. Further investigation revealed that there were symptoms similar to a curse recently occurring in his home, which could be greatly related to the changes in his behavior. At this moment, you realized that actions must be taken to stop more wrong judgments and to uncover the reason for his change.", "action": "Refuse", "valid_action": ["Help", "Refuse"]}, "2": {"current_obs": "After you refused to help a worker who was acting strangely under a curse, the situation took a critical turn. The next day, you discovered that the worker was publicly accusing you in the market of being behind the curse, twisting the truth to say that you hindered the investigation of the curse. The crowd at the market began to stir, and everyone's eyes were filled with suspicion and fear. The shadow of the curse made everyone overly sensitive, and a single word could trigger violence. You knew in your heart that if the situation was not handled promptly, it could lead to greater chaos and misunderstanding. You had to quickly decide how to deal with this crisis caused by a misunderstanding.", "action": "Escape", "valid_action": ["Fight", "Escape"]}, "3": {"current_obs": "In a narrow alley in the city, you stop walking with rapid breaths, with an angry crowd and a misguided worker behind you. Their shouts gradually fade away, and you successfully escape from pursuit. As midnight arrives, a mysterious woman wearing a cloak approaches you. Her eyes are deep and calm, as if she can see right through your soul. \"I know you are not what they say you are,\" she quietly says, handing you a sealed envelope, \"If you want to clear your name and uncover the truth, go to the abandoned library in the north district. All the answers you need are there.\" After speaking, she disappears into the night, leaving only you and the mysterious envelope behind.", "action": "Fight", "valid_action": ["Explore", "Fight"]}, "4": {"current_obs": "On the way to an abandoned library, suddenly a group of seemingly crazed wanderers surrounded you. There was no sign of sanity in their eyes, only violence and madness. Your heart raced, knowing these people were deeply affected by a curse, out of control. Just as you were preparing to fight, a soldier in armor suddenly appeared, swinging a sword to help you. After the battle, the soldier took off her helmet; she was a righteous guard dedicated to protecting the citizens who were not cursed. \"It seems you have your own mission,\" she said, \"If you are willing, I can join you to uncover the truth behind the curse.\" Her gaze was firm, clearly she felt a deep responsibility to fight against the curse.", "action": "Refuse", "valid_action": ["Help", "Refuse"]}, "5": {"current_obs": "After refusing the guard's help, you continue alone on the road to the abandoned library. The exceptional quietness along the way fills you with nervousness. Upon arriving at the library, you notice that the door is marked with a strange symbol that corresponds exactly with the mysterious symbol in the envelope. You push open the heavy door and a musty smell hits you, with dusty books on the shelves emitting an ancient aura. Venturing deeper into the library, you find a large open book with pages full of graffiti-like runes. Just as you try to decipher them, you suddenly feel someone watching you from the shadows. Turning around, you see a tall man standing in the darkness, his face hard to distinguish in the shadows, but his eyes reveal suspicion and curiosity. \"Why did you refuse to join forces? Don't you know how dangerous it is to come here alone?\" he asks in a deep voice, clearly puzzled by your choice.\n", "action": "Fight", "valid_action": ["Explore", "Fight"]}}